In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
dic = {'a':10,'b':20, 'c':30}

In [6]:
arr

array([10, 20, 30])

In [7]:
dic

{'a': 10, 'b': 20, 'c': 30}

In [9]:
dic['a']

10

In [12]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [13]:
pd.Series(my_data, label)

a    10
b    20
c    30
dtype: int64

In [15]:
ps = pd.Series(label, my_data)

In [16]:
ps

10    a
20    b
30    c
dtype: object

In [20]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [22]:
ps[10]

'a'

In [29]:
ser1 = pd.Series([1,2,3,4],['USA', 'India', 'Germany', 'USSR'])
ser2 = pd.Series([1,2,5,4],['USA', 'India', 'France', 'Italy'])

In [30]:
ser2

USA       1
India     2
France    5
Italy     4
dtype: int64

In [31]:
ser1+ser2

France     NaN
Germany    NaN
India      4.0
Italy      NaN
USA        2.0
USSR       NaN
dtype: float64

In [32]:
ser1*ser2

France     NaN
Germany    NaN
India      4.0
Italy      NaN
USA        1.0
USSR       NaN
dtype: float64

In [33]:
1/ser1

USA        1.000000
India      0.500000
Germany    0.333333
USSR       0.250000
dtype: float64

In [34]:
1/(ser1+ser2)

France      NaN
Germany     NaN
India      0.25
Italy       NaN
USA        0.50
USSR        NaN
dtype: float64

In [41]:
np.random.randn()

0.6836436378716739

In [49]:
df=pd.DataFrame(randn(4,3),['A','B','C','D'],['X','Y','Z'])

In [47]:
from numpy.random import randn

In [50]:
df['X']

A   -0.849936
B    0.034764
C   -0.162778
D    0.189800
Name: X, dtype: float64

In [52]:
type(sum)

builtin_function_or_method

In [53]:
type(df)

pandas.core.frame.DataFrame

In [57]:
type(df['X'])

pandas.core.series.Series

In [61]:
df[['X','Z']]

          X         Z
A -0.849936 -1.110650
B  0.034764 -0.941371
C -0.162778 -0.806646
D  0.189800  1.084040

In [62]:
df

          X         Y         Z
A -0.849936 -1.358875 -1.110650
B  0.034764  0.910989 -0.941371
C -0.162778  1.299004 -0.806646
D  0.189800 -1.311914  1.084040

In [69]:
df['new'] = df['X']+df['Y']

In [75]:
df.drop('C',axis=0)

          X         Y         Z       new
A -0.849936 -1.358875 -1.110650 -2.208811
B  0.034764  0.910989 -0.941371  0.945753
D  0.189800 -1.311914  1.084040 -1.122114

In [76]:
df.drop('new',axis=1)

          X         Y         Z
A -0.849936 -1.358875 -1.110650
B  0.034764  0.910989 -0.941371
C -0.162778  1.299004 -0.806646
D  0.189800 -1.311914  1.084040

In [79]:
df.drop('new',axis=1,inplace=True)

In [80]:
df

          X         Y         Z
A -0.849936 -1.358875 -1.110650
B  0.034764  0.910989 -0.941371
C -0.162778  1.299004 -0.806646
D  0.189800 -1.311914  1.084040

In [83]:
type(df.loc['A'])

pandas.core.series.Series

In [2]:
df.iloc[2]

NameError: name 'df' is not defined

In [88]:
df.loc['B':,:'Y']

          X         Y
B  0.034764  0.910989
C -0.162778  1.299004
D  0.189800 -1.311914

In [95]:
df.loc['A':'B', ['X','Z']]

          X         Z
A -0.849936 -1.110650
B  0.034764 -0.941371

In [1]:
df

NameError: name 'df' is not defined

In [3]:
from numpy.random import randn

NameError: name 'pd' is not defined

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A -1.500821  1.110696  0.972903  0.745873
B -0.707967 -0.013394 -0.255638 -0.339375
C -1.427472 -1.355034 -0.496117  0.507349
D  1.506296 -1.325121 -0.349028  1.666381
E -0.499082 -1.796806 -0.665130 -0.524375

In [9]:
df[df>0]

          W         X         Y         Z
A       NaN  1.110696  0.972903  0.745873
B       NaN       NaN       NaN       NaN
C       NaN       NaN       NaN  0.507349
D  1.506296       NaN       NaN  1.666381
E       NaN       NaN       NaN       NaN

In [10]:
df['X']>0

A     True
B    False
C    False
D    False
E    False
Name: X, dtype: bool

In [11]:
df[df['X']>0]

          W         X         Y         Z
A -1.500821  1.110696  0.972903  0.745873

In [16]:
df[df['Z']>0][['X','Y']]

          X         Y
A  1.110696  0.972903
C -1.355034 -0.496117
D -1.325121 -0.349028

In [30]:
df[(df['Z']>0) & (df['Y']>0)]

          W         X         Y         Z
A -1.500821  1.110696  0.972903  0.745873

In [36]:
df[(df['Z']>1) | (df['Y']>2)]

          W         X         Y         Z
D  1.506296 -1.325121 -0.349028  1.666381

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.500821  1.110696  0.972903  0.745873
1     B -0.707967 -0.013394 -0.255638 -0.339375
2     C -1.427472 -1.355034 -0.496117  0.507349
3     D  1.506296 -1.325121 -0.349028  1.666381
4     E -0.499082 -1.796806 -0.665130 -0.524375

In [40]:
df['States']=['CY','NY', 'PA','AL', 'OR']

In [45]:
df.set_index('States').reset_index()['States']

0    CY
1    NY
2    PA
3    AL
4    OR
Name: States, dtype: object

In [43]:
df

          W         X         Y         Z States
A -1.500821  1.110696  0.972903  0.745873     CY
B -0.707967 -0.013394 -0.255638 -0.339375     NY
C -1.427472 -1.355034 -0.496117  0.507349     PA
D  1.506296 -1.325121 -0.349028  1.666381     AL
E -0.499082 -1.796806 -0.665130 -0.524375     OR

In [50]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

In [51]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [52]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [53]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [54]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [55]:
df

             A         B
G1 1 -0.412488  1.621124
   2  0.958278 -0.188374
   3 -0.472869 -0.219008
G2 1 -0.467489  0.022171
   2  1.047225 -0.531814
   3 -0.146360 -0.103050

In [57]:
df.index.names = ['Groups','Num']

In [58]:
df

                   A         B
Groups Num
G1     1   -0.412488  1.621124
       2    0.958278 -0.188374
       3   -0.472869 -0.219008
G2     1   -0.467489  0.022171
       2    1.047225 -0.531814
       3   -0.146360 -0.103050

In [62]:
df.loc['G2'].loc[2].loc['B']

-0.5318138166097036

In [64]:
df.xs(2,level='Num')

               A         B
Groups
G1      0.958278 -0.188374
G2      1.047225 -0.531814

In [71]:
import numpy as np
dic = {'A':[1,2,np.nan], 'B':[4,np.nan,np.nan], 'C':[1,2,3]}

In [72]:
df1 = pd.DataFrame(dic)

In [73]:
df1

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
df1.dropna()

     A    B  C
0  1.0  4.0  1

In [77]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  4.0  1
1  2.0  NaN  2

In [78]:
df1.fillna('Fill Value')

            A           B  C
0           1           4  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [83]:
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [84]:
df1.fillna(df1.mean())

     A    B  C
0  1.0  4.0  1
1  2.0  4.0  2
2  1.5  4.0  3

In [85]:
d = {'Company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
        'Person':['Sam','Alex','Kelly','Emma','Charlie','Ryan'],
        'Sales':[124,650,200,180,560,230]}

In [86]:
df2 = pd.DataFrame(d)

In [96]:
df2

     Company   Person  Sales
0     Google      Sam    124
1     Google     Alex    650
2  Microsoft    Kelly    200
3  Microsoft     Emma    180
4   Facebook  Charlie    560
5   Facebook     Ryan    230

In [99]:
df2.groupby('Company').max()

          Person  Sales
Company
Facebook    Ryan    560
Google       Sam    650
Microsoft  Kelly    200

In [106]:
df2.groupby('Company').describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   395.000000  387.000000  190.000000
      std    233.345238  371.938167   14.142136
      min    230.000000  124.000000  180.000000
      25%    312.500000  255.500000  185.000000
      50%    395.000000  387.000000  190.000000
      75%    477.500000  518.500000  195.000000
      max    560.000000  650.000000  200.000000

In [122]:
dfl = pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']},index=[0,1,2,3])
dfr = pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']},index=[4,5,6,7])

In [124]:
pd.concat([dfl,dfr],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [137]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],'key2':['K0','K1','K0','K1'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key1':['K0','K1','K1','K2'],'key2':['K0','K0','K0','K0'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [148]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [138]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [144]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [149]:
left1 = pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index=['K0','K1','K2'])
right1 = pd.DataFrame({'C':['C0','C2','C3'],'D':['D0','D2','D3']},index=['K0','K2','K3'])

In [150]:
left1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [151]:
right1

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [153]:
left1.join(right1)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [154]:
right1.join(left1)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN